///Copyright (c) 2021, https://github.com/Larii75 Linchenko Andrii
///
///Разрешается повторное распространение и использование как в виде исходного кода, так и в двоичной форме, с изменениями или без, при соблюдении следующих условий:
///
///При повторном распространении исходного кода должно оставаться указанное выше уведомление об авторском праве, этот список условий и последующий отказ от гарантий.
///При повторном распространении двоичного кода должна сохраняться указанная выше информация об авторском праве, этот список условий и последующий отказ от гарантий 
///в документации и/или в других материалах, поставляемых при распространении. 
///Ни название <Организации>, ни имена её сотрудников не могут быть использованы в качестве поддержки или продвижения продуктов, основанных на этом ПО без предварительного письменного разрешения.
///ЭТА ПРОГРАММА ПРЕДОСТАВЛЕНА ВЛАДЕЛЬЦАМИ АВТОРСКИХ ПРАВ И/ИЛИ ДРУГИМИ СТОРОНАМИ «КАК ОНА ЕСТЬ» БЕЗ КАКОГО-ЛИБО ВИДА ГАРАНТИЙ, ВЫРАЖЕННЫХ ЯВНО ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ, 
///ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ. 
///НИ В КОЕМ СЛУЧАЕ НИ ОДИН ВЛАДЕЛЕЦ АВТОРСКИХ ПРАВ И НИ ОДНО ДРУГОЕ ЛИЦО, КОТОРОЕ МОЖЕТ ИЗМЕНЯТЬ И/ИЛИ ПОВТОРНО РАСПРОСТРАНЯТЬ ПРОГРАММУ, КАК БЫЛО СКАЗАНО ВЫШЕ, НЕ НЕСЁТ ОТВЕТСТВЕННОСТИ,
///ВКЛЮЧАЯ ЛЮБЫЕ ОБЩИЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ ИЛИ ПОСЛЕДОВАВШИЕ УБЫТКИ, ВСЛЕДСТВИЕ ИСПОЛЬЗОВАНИЯ ИЛИ НЕВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ ПРОГРАММЫ 
///(ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ПОТЕРЕЙ ДАННЫХ, ИЛИ ДАННЫМИ, СТАВШИМИ НЕПРАВИЛЬНЫМИ, ИЛИ ПОТЕРЯМИ, ПРИНЕСЕННЫМИ ИЗ-ЗА ВАС ИЛИ ТРЕТЬИХ ЛИЦ, 
///ИЛИ ОТКАЗОМ ПРОГРАММЫ РАБОТАТЬ СОВМЕСТНО С ДРУГИМИ ПРОГРАММАМИ), ДАЖЕ ЕСЛИ ТАКОЙ ВЛАДЕЛЕЦ ИЛИ ДРУГОЕ ЛИЦО БЫЛИ ИЗВЕЩЕНЫ О ВОЗМОЖНОСТИ ТАКИХ УБЫТКОВ.
///
///Copyright (c) 2021, https://github.com/Larii75 Linchenko Andrii All rights reserved.
///
///Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:
///
///Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.
///Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.
///Neither the name of the <ORGANIZATION> nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.
///THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, 
///THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER 
///OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, 
///PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
///LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
///EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

// Процедура - Сформировать SVG
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура СформироватьSVG(Команда)
	
	СформироватьSVGНаСервере();
	
КонецПроцедуры

// Процедура - Сформировать SVGНа сервере
//
&НаСервере
Процедура СформироватьSVGНаСервере()
	
	Штрихкод1D = Шк_Barcode1D_Сервер.НовыйШтрихкод1D();
	Штрихкод1D.СтрокаККодировке = СтрокаККодировке;
	Штрихкод1D.ТипШтрихкода = ТипШтрихкода;
	Штрихкод1D.ВыводитьРамку = Ложь;
	Штрихкод1D.Поворот = Поворот;
	Штрихкод1D.ВысотаШтрихкодаПикс = Неопределено;
	Штрихкод1D.Шрифт = Шрифт;
	Штрихкод1D.ЦветШтрихкода = ЦветШтрихкода;
	Штрихкод1D.ЦветСимволовТекста = ЦветТекста;
	Штрихкод1D.ПоложениеТекстаПоВертикали = ПоложениеТекстаПоВертикали;
	Штрихкод1D.ПоложениеТекстаПоГоризонтали = ПоложениеТекстаПоГоризонтали;
	Штрихкод1D.Трекинг = ДлинаТекста;
	Штрихкод1D.ВыводитьТекст = Истина;
	
	ШК = Шк_Barcode1D_Сервер.СформироватьSVG(Штрихкод1D);
	
	ТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	ТабДок.Рисунки[0].Картинка = Шк.Картинка;
	ТабДок.Рисунки[0].Верх = 0;
	ТабДок.Рисунки[0].Лево = 0;
	Если Шк.Поворот Тогда
		Если НЕ Шк.ВывестиТекст = "Invalid barcode!" Тогда
			Если ТипШтрихкода = "EAN13" Тогда
				ТабДок.Рисунки[0].Высота = 38;
				ТабДок.Рисунки[0].Ширина = 28;
			ИначеЕсли ТипШтрихкода = "EAN8" Тогда
				ТабДок.Рисунки[0].Высота = 27;
				ТабДок.Рисунки[0].Ширина = 22;
			ИначеЕсли ТипШтрихкода = "ITF14" Тогда
				ТабДок.Рисунки[0].Высота = 158;
				ТабДок.Рисунки[0].Ширина = 54;
			Иначе
				ТабДок.Рисунки[0].Высота = Формат(Число(СтрЗаменить(Шк.ДлинаSVG, "mm", "")), "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧРГ=; ЧН=0; ЧГ=0");
				ТабДок.Рисунки[0].Ширина = 30;	
			КонецЕсли;
		Иначе
			ТабДок.Рисунки[0].Высота = Формат(Число(СтрЗаменить(Шк.ДлинаSVG, "mm", "")), "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧРГ=; ЧН=0; ЧГ=0");
			ТабДок.Рисунки[0].Ширина = Формат(Число(СтрЗаменить(Шк.ВысотаSVG, "mm", "")), "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧРГ=; ЧН=0; ЧГ=0");
		КонецЕсли;
	Иначе
		Если НЕ Шк.ВывестиТекст = "Invalid data!" Тогда
			Если ТипШтрихкода = "EAN13" Тогда
				ТабДок.Рисунки[0].Высота = 28;
				ТабДок.Рисунки[0].Ширина = 38;
			ИначеЕсли ТипШтрихкода = "EAN8" Тогда
				ТабДок.Рисунки[0].Высота = 22;
				ТабДок.Рисунки[0].Ширина = 27;
			ИначеЕсли ТипШтрихкода = "ITF14" Тогда
				ТабДок.Рисунки[0].Высота = 54;
				ТабДок.Рисунки[0].Ширина = 158;
			Иначе
				ТабДок.Рисунки[0].Высота = Формат(Число(СтрЗаменить(Шк.ВысотаSVG, "mm", "")), "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧРГ=; ЧН=0; ЧГ=0");
				ТабДок.Рисунки[0].Ширина = Формат(Число(СтрЗаменить(Шк.ДлинаSVG, "mm", "")), "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧРГ=; ЧН=0; ЧГ=0");
			КонецЕсли;
		Иначе
			ТабДок.Рисунки[0].Высота = 30;
			ТабДок.Рисунки[0].Ширина = Формат(Число(СтрЗаменить(Шк.ДлинаSVG, "mm", "")), "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧРГ=; ЧН=0; ЧГ=0");
		КонецЕсли;
	КонецЕсли;
	ТабДок.Рисунки[0].РазмерКартинки = РазмерКартинки.РеальныйРазмер;
	ТабДок.Рисунки[0].ГраницаСверху = Ложь;
	ТабДок.Рисунки[0].ГраницаСнизу = Ложь;
	ТабДок.Рисунки[0].ГраницаСлева = Ложь;
	ТабДок.Рисунки[0].ГраницаСправа = Ложь;
	ТабДок.Рисунки[0].ЦветФона = ЦветФона;
	
КонецПроцедуры // СформироватьSVGНаСервере()

// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДлинаТекста = 0;
	ЦветФона = Новый Цвет(255, 255, 255);
	Шрифт = Новый Шрифт("monospace", 14);
	ТипШтрихкода = Элементы.ТипШтрихкода.СписокВыбора.НайтиПоЗначению("EAN13").Значение;
	УстановитьСвойстваЭлементовПоТипуШтрихкода(ТипШтрихкода, ПоложениеТекстаПоГоризонтали, ПоложениеТекстаПоВертикали, Шрифт, ДлинаТекста, ВыводитьРамку, Элементы);
	
КонецПроцедуры

// Процедура - Установить свойства элементов по типу штрихкода
//
// Параметры:
//  ТипШтрихкода				 - 	 - 
//  ПоложениеТекстаПоГоризонтали - 	 - 
//  ПоложениеТекстаПоВертикали	 - 	 - 
//  Шрифт						 - 	 - 
//  ДлинаТекста					 - 	 - 
//  ВыводитьРамку				 - 	 - 
//  Элементы					 - 	 - 
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементовПоТипуШтрихкода(ЗНАЧ ТипШтрихкода, ПоложениеТекстаПоГоризонтали, ПоложениеТекстаПоВертикали, Шрифт, ДлинаТекста, ВыводитьРамку, Элементы)
	
	Если ТипШтрихкода = "EAN13" Тогда 
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Истина;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 14);
		ПоложениеТекстаПоГоризонтали = 0;
		ПоложениеТекстаПоВертикали = 24.5;
		ДлинаТекста = 0;
		Элементы.СтрокаККодировке.Заголовок = "Введите 12 чисел";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Ложь;
	ИначеЕсли ТипШтрихкода = "EAN13AddOn2" Тогда
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Истина;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 14);
		ПоложениеТекстаПоГоризонтали = 0;
		ПоложениеТекстаПоВертикали = 24.5;
		ДлинаТекста = 0;
		Элементы.СтрокаККодировке.Заголовок = "Введите 14 чисел";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Ложь;
	ИначеЕсли ТипШтрихкода = "EAN13AddOn5" Тогда
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Истина;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 14);
		ПоложениеТекстаПоГоризонтали = 0;
		ПоложениеТекстаПоВертикали = 24.5;
		ДлинаТекста = 0;
		Элементы.СтрокаККодировке.Заголовок = "Введите 17 чисел";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Ложь;
	ИначеЕсли ТипШтрихкода = "EAN8" Тогда
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Истина;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 13);
		ПоложениеТекстаПоГоризонтали = 3;
		ПоложениеТекстаПоВертикали = 20;
		ДлинаТекста = 0;
		Элементы.СтрокаККодировке.Заголовок = "Введите 7 чисел";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Ложь;
	ИначеЕсли ТипШтрихкода = "PHARMACODE" Тогда
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Ложь;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 0);
		ПоложениеТекстаПоГоризонтали = 0;
		ПоложениеТекстаПоВертикали = 100;
		ДлинаТекста = 0;
		Элементы.СтрокаККодировке.Заголовок = "Введите число до 131070";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Ложь;
	ИначеЕсли ТипШтрихкода = "MSI" Тогда
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Ложь;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 16);
		ПоложениеТекстаПоГоризонтали = 0;
		ПоложениеТекстаПоВертикали = 91;
		ДлинаТекста = 2;
		Элементы.СтрокаККодировке.Заголовок = "Введите до 12 ASCII символов";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Истина;
	ИначеЕсли ТипШтрихкода = "CODABAR" Тогда
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Ложь;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 8);
		ПоложениеТекстаПоГоризонтали = 0;
		ПоложениеТекстаПоВертикали = 46;
		ДлинаТекста = 2;
		Элементы.СтрокаККодировке.Заголовок = "Введите до 48 цифр или ""ABCD:+-$/"" символов";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Истина;
	ИначеЕсли ТипШтрихкода = "CODE39" ИЛИ ТипШтрихкода = "CODE39FullASCII" Тогда
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Ложь;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 14);
		ПоложениеТекстаПоГоризонтали = 0;
		ПоложениеТекстаПоВертикали = 91;
		ДлинаТекста = 5;
		Элементы.СтрокаККодировке.Заголовок = "Введите до 48 ASCII символа";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Истина;
	ИначеЕсли ТипШтрихкода = "CODE11" Тогда
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Ложь;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 12);
		ПоложениеТекстаПоГоризонтали = 0;
		ПоложениеТекстаПоВертикали = 80;
		ДлинаТекста = 6;
		Элементы.СтрокаККодировке.Заголовок = "Введите до 48 цифр или символов ""-""";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Истина;
	ИначеЕсли ТипШтрихкода = "CODE93" Тогда
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Ложь;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 14);
		ПоложениеТекстаПоГоризонтали = 0;
		ПоложениеТекстаПоВертикали = 91;
		ДлинаТекста = 2;
		Элементы.СтрокаККодировке.Заголовок = "Введите до 80 ASCII символов";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Истина;
	ИначеЕсли ТипШтрихкода = "CODE128" ИЛИ ТипШтрихкода = "EAN128" Тогда
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Ложь;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 14);
		ПоложениеТекстаПоГоризонтали = 0;
		ПоложениеТекстаПоВертикали = 73;
		ДлинаТекста = 1;
		Элементы.СтрокаККодировке.Заголовок = "Введите до 80 ASCII символов";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Истина;
	ИначеЕсли ТипШтрихкода = "CODE2OF5" Тогда
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Ложь;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 14);
		ПоложениеТекстаПоГоризонтали = 0;
		ПоложениеТекстаПоВертикали = 80;
		ДлинаТекста = 2;
		Элементы.СтрокаККодировке.Заголовок = "Введите до 80 ASCII символов";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Истина;
	ИначеЕсли ТипШтрихкода = "INDUSTRIAL2OF5" Тогда
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Ложь;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 14);
		ПоложениеТекстаПоГоризонтали = 0;
		ПоложениеТекстаПоВертикали = 72;
		ДлинаТекста = 2;
		Элементы.СтрокаККодировке.Заголовок = "Введите до 48 цифр";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Истина;
	ИначеЕсли ТипШтрихкода = "ITF14" Тогда
		Элементы.ПоложениеТекстаПоГоризонтали.Доступность = Ложь;
		Шрифт = Новый Шрифт(Шрифт, Шрифт.Имя, 26);
		ПоложениеТекстаПоГоризонтали = 0;
		ПоложениеТекстаПоВертикали = 45;
		ДлинаТекста = 3;
		Элементы.СтрокаККодировке.Заголовок = "Введите 13 чисел";
		ВыводитьРамку = Ложь;
		Элементы.ВыводитьРамку.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьСвойстваЭлементовПоТипуШтрихкода()

// Процедура - Тип штрихкода при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура ТипШтрихкодаПриИзменении(Элемент)
		
	УстановитьСвойстваЭлементовПоТипуШтрихкода(ТипШтрихкода, ПоложениеТекстаПоГоризонтали, ПоложениеТекстаПоВертикали, Шрифт, ДлинаТекста, ВыводитьРамку, Элементы);
	
КонецПроцедуры
